---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips
source: html/1bb025ef-184a-e42b-3510-ec01dafa0df7.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips

Defines parameters for Z Profile with lips structural section.

## Syntax (C#)
```csharp
public class StructuralSectionZProfileWithLips : StructuralSectionGeneralLZ
```